---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings.#ctor
source: html/5bef94a2-0891-3db6-45ab-210cc0d55e35.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings.#ctor Method

Constructs a default instance of markers and text settings.

## Syntax (C#)
```csharp
public AnalysisDisplayMarkersAndTextSettings()
```